# Для списку цілих чисел потрібно знайти суму елементів із парними індексами [0-й, 2-й, 4-й ітд],
# потім перемножити цю суму на останній елемент вхідного масиву.
#
# Не забудьте, що перший елемент масиву має індекс 0.
#
# Для порожнього масиву результат завжди 0.
#
# Пояснення:
#
# [0, 1, 7, 2, 4, 8] => (0 + 7 + 4) * 8 = 88

# [1, 3, 5] => 30
# [6] => 36
# [] => 0

# lst = [6]
# lst = []
lst = [1, 3, 5]
summa = 0
if len(lst) != 0:
    for i in range(0, len(lst), 2):
        summa += lst[i]
    print(summa * lst[-1])
else:
    print(0)
