# Ваше завдання — написати програму, яка переводить число у формат часу у читальному вигляді.
#
# Користувач повинен ввести число більше або дорівнює 0 і менше ніж 8640000.
#
# Число, яке є кількістю секунд, необхідно перевести в дні, години, хвилини та секунди.
#
# Ну і додатковим завданням є турбота про виведення.
#
# Слово "день" підбирається на основі кількох днів, а години, хвилини
# і секунди повинні заповнюватися нулями при одноцифрових значеннях.

# Підказка: одна хвилина - 60 сек. , В одній годині 60 * 60 сек, в одній добі 24 * 60 * 60 сек.
# Тобто використовуючи функцію divmod або методи поділу // і % вам необхідно знайти відповідну кількість днів,
# годин, хвилин, а те що залишиться - це секунди, які менше 60 ;)
#
# Доповнити провідними нулями можна за допомогою методу zfill(2)

# 0 -> 0 днів, 00:00:00
# 224930 -> 2 дні, 14:28:50
# 466289 -> 5 днів, 09:31:29
# 950400 -> 11 днів, 00:00:00
# 1209600 -> 14 днів, 00:00:00
# 1900800 - > 22 дні, 00:00:00
# 8639999 -> 99 днів, 23:59:59
# 22493 -> 0 днів, 06:14:53
# 7948799 -> 91 день, 23:59:59

date = int(input("Enter the number from 0 to 8640000: "))
day, a = divmod(date, 24 * 60 * 60)
hours, b = divmod(a, 60 * 60)
minutes, sec = divmod(b, 60)

day = str(day)
last_day = int(day[-1])
days = {0: "днів", 1: "день", 2: "дні", 3: "дні", 4: "дні", 5: "днів", 6: "днів", 7: "днів", 8: "днів", 9: "днів"}
day_name = days[last_day]

if date >= 10 * 24 * 60 * 60:
    before_last = int(day[-2])
    if before_last == 1:
        day_name = "днів"

print(f"{day} {day_name}, {str(hours).zfill(2)}:{str(minutes).zfill(2)}:{str(sec).zfill(2)}")
