# Ваша програма має перенести останній елемент списку з кінця на початок,
# тобто, останній елемент списку має стати першим. Послідовність інших елементів не має змінюватися.
#
# Порожній список або список з одним елементом повинен залишитися незмінним.
#
# Кількість елементів у списку може бути будь-яким – нуль та більше!

# [12, 3, 4, 10] # => [10, 12, 3, 4]
# [1] => [1]
# [] => []
# [12, 3, 4, 10, 8] => [8, 12, 3, 4, 10]

lst = [12, 3, 4, 10]
# lst = [1]
# lst = []
# lst = [12, 3, 4, 10, 8]

if len(lst) == 0:
    print(lst)
else:
    a = lst.pop()
    lst.insert(0, a)
    print(lst)