# На запит від програми, користувач вводить 5-ти значне ціле, позитивне число.
# Вам необхідно "перевернути" цє число  задом наперед, тобто щоб у результаті вийшло теж 5-ти значне число,
# але із зворотною послідовністю цифр.
#
# Вам не потрібно перевіряти, що користувач ввів правильне число - зробіть вигляд,
# що користувач завжди вводить 5 значне число. Тобто введене користувачем число завжди складатиметься з 5 цифр.
#
# Якщо користувач ввів інше число, це проблема користувача, а не вашої програми.
#
# Використовуються лише цілі числа.
#
# Для розв'язання задачі потрібно використовувати лише той зріз даних, який було пройдено.
# Тобто використовувати строки не можна.

x = int(input('Введіть ціле позитивне 5-значне число: '))
a = x % 10
b = (x // 10) % 10
c = (x // 100) % 10
d = (x // 1000) % 10
e = (x // 10000) % 10
print(a * 10000 + b * 1000 + c * 100 + d * 10 + e)